{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {"type": "string"},
    "ruleId": {"type": "string", "defaultValue": "role-assignment-changes"}
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "apiVersion": "2022-11-01-preview",
      "name": "[format('{0}/Microsoft.SecurityInsights/{1}', parameters('workspaceName'), parameters('ruleId'))]",
      "properties": {
        "displayName": "Privileged role assignment changes",
        "enabled": true,
        "kind": "Scheduled",
        "query": "AuditLogs | where Category == 'RoleManagement' and (ActivityDisplayName has 'Add' or ActivityDisplayName has 'Remove') | summarize count() by bin(TimeGenerated, 1h) | where count_ > 0",
        "queryFrequency": "PT1H",
        "queryPeriod": "PT1H",
        "severity": "High",
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "eventGroupingSettings": {"aggregationKind": "SingleAlert"}
      }
    }
  ]
}

